app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `status`, `slug`) VALUES ('Ababa', '3213214124', '2022-05-07 23:45:53.297046', '2022-05-07 23:45:53.297046', 'public', 'ababa')

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `articles`.`body` = 'I am on Railsabab', `articles`.`updated_at` = '2022-05-07 22:15:57.845507' WHERE `articles`.`id` = 1